app/controllers/api/v1/subscriptions_controller.rb

  def index
    # binding.pry
    if Customer.where("id = #{params[:customer_id]}").count == 0
      render json: { data: { errors: "Customer does not exist"} }, status: 401
    else
      customer = Customer.find(params[:customer_id])
---
SELECT COUNT(*) FROM "customers" WHERE (id = 113)
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # binding.pry
    customer = Customer.find(params[:customer_id])
    subscription = Subscription.create(title: params[:title],
              price: params[:price],
              frequency: params[:frequency],
              tea_id: params[:tea_id],
              customer_id: params[:customer_id])
    if subscription.save
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "customers" ("first_name", "last_name", "email", "address") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Jim"], ["last_name", "Raddle"], ["email", "test@test.com"], ["address", "drury lane"]]
INSERT INTO "teas" ("title", "description", "temperature", "brew_time") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "black tea"], ["description", "some pretty good black tea"], ["temperature", 80], ["brew_time", 5]]
INSERT INTO "subscriptions" ("title", "price", "frequency", "tea_id", "customer_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "first_subscription"], ["price", "40 dollars"], ["frequency", 0], ["tea_id", 1], ["customer_id", 1]]
UPDATE "subscriptions" SET "status" = $1 WHERE "subscriptions"."id" = $2  [["status", 1], ["id", 1]]

  def update
    if Subscription.where("id = #{params[:id]}").count == 0
      render json: { data: { errors: "Subscription does not exist"} }, status: 401
    else
      subscription = Subscription.update(params[:id], subscription_params)
      if subscription.save
---
SELECT COUNT(*) FROM "subscriptions" WHERE (id = 241)
UPDATE "subscriptions" SET "status" = $1 WHERE "subscriptions"."id" = $2  [["status", 1], ["id", 138]]
INSERT INTO "subscriptions" ("title", "price", "status", "frequency", "tea_id", "customer_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "babys first subscription"], ["price", "50 dollars"], ["status", 1], ["frequency", 0], ["tea_id", 155], ["customer_id", 82]]